Revit 2027 API
BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptions Property
 An element may not reference an element in another Option of the same Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadReferenceBetweenOptions { get; }
Public Shared ReadOnly Property BadReferenceBetweenOptions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadReferenceBetweenOptions {
	FailureDefinitionId^ get ();
}
static member BadReferenceBetweenOptions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace